D1
Linux Unix (Intel-x86) processor with 199881K bytes of memory.
Processor board ID 6
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


D1>
D1>en
Password: 
D1#sh ip route | i c
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#sh ip route | i  
D1#sh ip route | include conn
D1#sh ip route | include connec
D1#sh ip route | include connecte
D1#sh ip route | include connected
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#sh ip route | i c
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
D1(config)#router eigrp 100
D1(config-router)# no auto-summary
D1(config-router)# network 10.1.4.4 0.0.0.3
D1(config-router)# network 10.2.1.0 0.0.0.255
D1(config-router)# network 10.2.2.0 0.0.0.255
D1(config-router)# network 192.168.1.128 0.0.0.31
D1(config-router)#end
D1#sh ip eigrp nei
D1#sh ip eigrp neighbor  
EIGRP-IPv4 Neighbors for AS(100)
H   Address                 Interface              Hold Uptime   SRTT   RTO  Q  Seq
                                                   (sec)         (ms)       Cnt Num
3   10.1.4.5                Et1/1                    11 00:02:56   16   150  0  7
2   192.168.1.130           Vl200                    12 00:03:19    6   100  0  9
1   10.2.2.2                Vl20                     11 00:03:19   11   100  0  11
0   10.2.1.2                Vl10                     12 00:03:19   11   100  0  10
D1#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 7 subnets, 3 masks
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
D        10.1.4.8/30 [90/281856] via 192.168.1.130, 01:45:12, Vlan200
                     [90/281856] via 10.2.2.2, 01:45:12, Vlan20
                     [90/281856] via 10.2.1.2, 01:45:12, Vlan10
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
      192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#ping 3.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
D1#sh ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
D EX     1.1.1.1 [170/307200] via 10.1.4.5, 00:00:13, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
D EX     2.2.2.2 [170/307200] via 10.1.4.5, 00:00:13, Ethernet1/1
      3.0.0.0/32 is subnetted, 1 subnets
D EX     3.3.3.3 [170/307200] via 10.1.4.5, 00:00:13, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
D EX     4.4.4.4 [170/307200] via 10.1.4.5, 00:00:13, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 10 subnets, 3 masks
D EX     10.1.1.0/30 [170/307200] via 10.1.4.5, 00:00:13, Ethernet1/1
D EX     10.1.1.4/30 [170/307200] via 10.1.4.5, 00:00:13, Ethernet1/1
D EX     10.1.1.8/30 [170/307200] via 10.1.4.5, 00:00:13, Ethernet1/1
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
D        10.1.4.8/30 [90/281856] via 192.168.1.130, 02:01:38, Vlan200
                     [90/281856] via 10.2.2.2, 02:01:38, Vlan20
                     [90/281856] via 10.2.1.2, 02:01:38, Vlan10
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
      192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#ping 3.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
D1#ping 3.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
D1#sh ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      2.0.0.0/32 is subnetted, 1 subnets
D EX     2.2.2.2 [170/307200] via 10.1.4.5, 00:14:55, Ethernet1/1
      3.0.0.0/32 is subnetted, 1 subnets
D EX     3.3.3.3 [170/307200] via 10.1.4.5, 00:14:55, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
D EX     4.4.4.4 [170/307200] via 10.1.4.5, 00:14:55, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 10 subnets, 3 masks
D EX     10.1.1.0/30 [170/307200] via 10.1.4.5, 00:14:55, Ethernet1/1
D EX     10.1.1.4/30 [170/307200] via 10.1.4.5, 00:14:55, Ethernet1/1
D EX     10.1.1.8/30 [170/307200] via 10.1.4.5, 00:14:55, Ethernet1/1
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
D        10.1.4.8/30 [90/281856] via 192.168.1.130, 02:16:20, Vlan200
                     [90/281856] via 10.2.2.2, 02:16:20, Vlan20
                     [90/281856] via 10.2.1.2, 02:16:20, Vlan10
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
      192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
D EX     1.1.1.1 [170/307200] via 10.1.4.5, 00:00:08, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
D EX     2.2.2.2 [170/307200] via 10.1.4.5, 00:15:36, Ethernet1/1
      3.0.0.0/32 is subnetted, 1 subnets
D EX     3.3.3.3 [170/307200] via 10.1.4.5, 00:15:36, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
D EX     4.4.4.4 [170/307200] via 10.1.4.5, 00:15:36, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 10 subnets, 3 masks
D EX     10.1.1.0/30 [170/307200] via 10.1.4.5, 00:15:36, Ethernet1/1
D EX     10.1.1.4/30 [170/307200] via 10.1.4.5, 00:15:36, Ethernet1/1
D EX     10.1.1.8/30 [170/307200] via 10.1.4.5, 00:15:36, Ethernet1/1
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
D        10.1.4.8/30 [90/281856] via 192.168.1.130, 02:17:01, Vlan200
                     [90/281856] via 10.2.2.2, 02:17:01, Vlan20
                     [90/281856] via 10.2.1.2, 02:17:01, Vlan10
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
      192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is 10.1.4.5 to network 0.0.0.0

D*EX  0.0.0.0/0 [170/307200] via 10.1.4.5, 00:00:43, Ethernet1/1
      1.0.0.0/32 is subnetted, 1 subnets
D EX     1.1.1.1 [170/307200] via 10.1.4.5, 00:44:24, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
D EX     2.2.2.2 [170/307200] via 10.1.4.5, 00:59:52, Ethernet1/1
      3.0.0.0/32 is subnetted, 1 subnets
D EX     3.3.3.3 [170/307200] via 10.1.4.5, 00:59:52, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
D EX     4.4.4.4 [170/307200] via 10.1.4.5, 00:59:52, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 10 subnets, 3 masks
D EX     10.1.1.0/30 [170/307200] via 10.1.4.5, 00:59:52, Ethernet1/1
D EX     10.1.1.4/30 [170/307200] via 10.1.4.5, 00:59:52, Ethernet1/1
D EX     10.1.1.8/30 [170/307200] via 10.1.4.5, 00:59:52, Ethernet1/1
C        10.1.4.4/30 is directly connected, Ethernet1/1
L        10.1.4.6/32 is directly connected, Ethernet1/1
D        10.1.4.8/30 [90/281856] via 192.168.1.130, 03:01:17, Vlan200
                     [90/281856] via 10.2.2.2, 03:01:17, Vlan20
                     [90/281856] via 10.2.1.2, 03:01:17, Vlan10
C        10.2.1.0/24 is directly connected, Vlan10
L        10.2.1.1/32 is directly connected, Vlan10
C        10.2.2.0/24 is directly connected, Vlan20
L        10.2.2.1/32 is directly connected, Vlan20
      192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.1.128/27 is directly connected, Vlan200
L        192.168.1.129/32 is directly connected, Vlan200
D1#ping 8.8.8.8
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 8.8.8.8, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
D1#

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Solaris Software (I86BI_LINUXL2-IPBASEK9-M), Experimental Version 15.1(20130509:024903) [dstivers-may8-2013-team_track 103]
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 08-May-13 21:05 by dstivers
This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 199881K bytes of memory.
Processor board ID 6
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


D1>en
Password: 
D1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
D1(config)#router eigrp 100
D1(config-router)# no auto-summary
D1(config-router)# network 10.1.4.4 0.0.0.3
D1(config-router)# network 10.2.1.0 0.0.0.255
D1(config-router)# network 10.2.2.0 0.0.0.255
D1(config-router)# network 192.168.1.128 0.0.0.31
D1(config-router)#end
D1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
D1(config)#
D1(config)#router eigrp CCNPLEVEL
D1(config-router)#
D1(config-router)#address-family ipv4 unicast autonomous-system 100
%ERROR: AS(100) in use by classic router
D1(config-router)#
D1(config-router)#network 10.1.4.6 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#network 10.2.1.1 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#network 10.2.2.1 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#network 192.168.1.129 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#exit
D1(config)#conf t
                ^
% Invalid input detected at '^' marker.

D1(config)#
D1(config)#router eigrp CCNPLEVEL
D1(config-router)#
D1(config-router)#address-family ipv4 unicast autonomous-system 100
%ERROR: AS(100) in use by classic router
D1(config-router)#
D1(config-router)#network 10.1.4.6 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#network 10.2.1.1 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#network 10.2.2.1 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#network 192.168.1.129 0.0.0.0
                   ^
% Invalid input detected at '^' marker.

D1(config-router)#
D1(config-router)#end

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Solaris Software (I86BI_LINUXL2-IPBASEK9-M), Experimental Version 15.1(20130509:024903) [dstivers-may8-2013-team_track 103]
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 08-May-13 21:05 by dstivers
This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 199881K bytes of memory.
Processor board ID 6
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


D1>en
Password: 
D1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
D1(config)#router eigrp 100
D1(config-router)# no auto-summary
D1(config-router)# network 10.1.4.4 0.0.0.3
D1(config-router)# network 10.2.1.0 0.0.0.255
D1(config-router)# network 10.2.2.0 0.0.0.255
D1(config-router)# network 192.168.1.128 0.0.0.31
D1(config-router)#end
D1#

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Solaris Software (I86BI_LINUXL2-IPBASEK9-M), Experimental Version 15.1(20130509:024903) [dstivers-may8-2013-team_track 103]
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 08-May-13 21:05 by dstivers
This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 199881K bytes of memory.
Processor board ID 6
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


D1>en
Password: 
D1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
D1(config)#router eigrp 100
D1(config-router)# no auto-summary
D1(config-router)# network 10.1.4.4 0.0.0.3
D1(config-router)# network 10.2.1.0 0.0.0.255
D1(config-router)# network 10.2.2.0 0.0.0.255
D1(config-router)# network 192.168.1.128 0.0.0.31
D1(config-router)#end
D1#
D1#
D1#
D1#
D1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is 10.1.4.5 to network 0.0.0.0

D*EX  0.0.0.0/0 [170/307200] via 10.1.4.5, 00:05:38, Ethernet1/1
      1.0.0.0/32 is subnetted, 1 subnets
D EX     1.1.1.1 [170/307200] via 10.1.4.5, 00:05:38, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
D EX     2.2.2.2 [170/307200] via 10.1.4.5, 00:05:38, Ethernet1/1
      3.0.0.0/32 is subnetted, 1 subnets
D EX     3.3.3.3 [170/307200] via 10.1.4.5, 00:05:38, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
D EX     4.4.4.4 [170/307200] via 10.1.4.5, 00:05:38, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 10 subnets, 3 masks
D EX     10.1.1.0/30 [170/307200] via 10.1.4.5, 00:05:38, Ethernet1/1
 --More-- 