R2
   Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 11
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R2>
R2>
R2>en
Password: 
R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#Int loopback 0
R2(config-if)# ip add 2.2.2.2 255.255.255.255
R2(config-if)#router ospf 1
R2(config-router)#router-id 2.2.2.2
% OSPF: Reload or use "clear ip ospf process" command, for this to take effect
R2(config-router)#network 2.2.2.2 0.0.0.0 area 0
R2(config-router)#router ospf 1
R2(config-router)#network 10.1.1.4 0.0.0.3 area 0
R2(config-router)#network 10.1.1.0 0.0.0.3 area 0
R2(config-router)#exit
R2(config)#exit
R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#no router ospf 1
R2(config)#Int loopback 0
R2(config-if)# ip add 2.2.2.2 255.255.255.255
R2(config-if)#router ospf 1
R2(config-router)#router-id 2.2.2.2
R2(config-router)#network 2.2.2.2 0.0.0.0 area 0
R2(config-router)#router ospf 1
R2(config-router)#network 10.1.1.4 0.0.0.3 area 0
R2(config-router)#network 10.1.1.0 0.0.0.3 area 12
R2(config-router)#exit
R2(config)#do sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.1.1.1, 00:01:41, Ethernet1/2
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.1.1.6, 00:01:02, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O IA     4.4.4.4 [110/21] via 10.1.1.6, 00:01:02, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
O IA     10.1.1.8/30 [110/20] via 10.1.1.6, 00:01:02, Ethernet1/1
R2(config)#hostname R2-huaweiAR
R2-huaweiAR(config)#
R2-huaweiAR#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.1.1.1, 01:05:27, Ethernet1/2
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.1.1.6, 01:04:48, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O IA     4.4.4.4 [110/21] via 10.1.1.6, 01:04:48, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
O IA     10.1.1.8/30 [110/20] via 10.1.1.6, 01:04:48, Ethernet1/1
R2-huaweiAR#sh ip route     
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.1.1.1, 01:05:42, Ethernet1/2
      2.0.0.0/32 is subnetted, 1 subnets
C        2.2.2.2 is directly connected, Loopback0
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.1.1.6, 01:05:03, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O IA     4.4.4.4 [110/21] via 10.1.1.6, 01:05:03, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
C        10.1.1.0/30 is directly connected, Ethernet1/2
L        10.1.1.2/32 is directly connected, Ethernet1/2
C        10.1.1.4/30 is directly connected, Ethernet1/1
L        10.1.1.5/32 is directly connected, Ethernet1/1
O IA     10.1.1.8/30 [110/20] via 10.1.1.6, 01:05:03, Ethernet1/1
R2-huaweiAR#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.1.1.1, 01:24:58, Ethernet1/2
      2.0.0.0/32 is subnetted, 1 subnets
C        2.2.2.2 is directly connected, Loopback0
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.1.1.6, 01:24:19, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O IA     4.4.4.4 [110/21] via 10.1.1.6, 01:24:19, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
C        10.1.1.0/30 is directly connected, Ethernet1/2
L        10.1.1.2/32 is directly connected, Ethernet1/2
C        10.1.1.4/30 is directly connected, Ethernet1/1
L        10.1.1.5/32 is directly connected, Ethernet1/1
O IA     10.1.1.8/30 [110/20] via 10.1.1.6, 01:24:19, Ethernet1/1
O E2     10.1.4.4/30 [110/20] via 10.1.1.6, 00:00:11, Ethernet1/1
O E2     10.1.4.8/30 [110/20] via 10.1.1.6, 00:00:11, Ethernet1/1
O E2     10.2.1.0/24 [110/20] via 10.1.1.6, 00:00:11, Ethernet1/1
O E2     10.2.2.0/24 [110/20] via 10.1.1.6, 00:00:11, Ethernet1/1
      192.168.1.0/27 is subnetted, 1 subnets
O E2     192.168.1.128 [110/20] via 10.1.1.6, 00:00:11, Ethernet1/1
R2-huaweiAR#sh ip rou
R2-huaweiAR#sh ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O        1.1.1.1 [110/11] via 10.1.1.1, 00:17:23, Ethernet1/2
      2.0.0.0/32 is subnetted, 1 subnets
C        2.2.2.2 is directly connected, Loopback0
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/11] via 10.1.1.6, 01:52:19, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O IA     4.4.4.4 [110/21] via 10.1.1.6, 01:52:19, Ethernet1/1
      10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
C        10.1.1.0/30 is directly connected, Ethernet1/2
L        10.1.1.2/32 is directly connected, Ethernet1/2
C        10.1.1.4/30 is directly connected, Ethernet1/1
L        10.1.1.5/32 is directly connected, Ethernet1/1
O IA     10.1.1.8/30 [110/20] via 10.1.1.6, 01:52:19, Ethernet1/1
O E2     10.1.4.4/30 [110/20] via 10.1.1.6, 00:28:11, Ethernet1/1
O E2     10.1.4.8/30 [110/20] via 10.1.1.6, 00:28:11, Ethernet1/1
O E2     10.2.1.0/24 [110/20] via 10.1.1.6, 00:28:11, Ethernet1/1
O E2     10.2.2.0/24 [110/20] via 10.1.1.6, 00:28:11, Ethernet1/1
      192.168.1.0/27 is subnetted, 1 subnets
O E2     192.168.1.128 [110/20] via 10.1.1.6, 00:28:11, Ethernet1/1
R2-huaweiAR#C        209.9.9.0/24

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 11
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R2>en
Password: 
R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#Int loopback 0
R2(config-if)# ip add 2.2.2.2 255.255.255.255
R2(config-if)#router ospf 1
R2(config-router)#router-id 2.2.2.2
% OSPF: Reload or use "clear ip ospf process" command, for this to take effect
R2(config-router)#network 2.2.2.2 0.0.0.0 area 0
R2(config-router)#router ospf 1
R2(config-router)#network 10.1.1.4 0.0.0.3 area 0
R2(config-router)#network 10.1.1.0 0.0.0.3 area 12
R2(config-router)#

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 11
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R2>en
Password: 
R2#Int loopback 0
    ^
% Invalid input detected at '^' marker.

R2# ip add 2.2.2.2 255.255.255.255
       ^
% Invalid input detected at '^' marker.

R2#router ospf 1
       ^
% Invalid input detected at '^' marker.

R2#router-id 2.2.2.2
       ^
% Invalid input detected at '^' marker.

R2#network 2.2.2.2 0.0.0.0 area 0
    ^
% Invalid input detected at '^' marker.

R2#router ospf 1
       ^
% Invalid input detected at '^' marker.

R2#network 10.1.1.4 0.0.0.3 area 0
    ^
% Invalid input detected at '^' marker.

R2#network 10.1.1.0 0.0.0.3 area 12
    ^
% Invalid input detected at '^' marker.

R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#Int loopback 0
R2(config-if)# ip add 2.2.2.2 255.255.255.255
R2(config-if)#router ospf 1
R2(config-router)#router-id 2.2.2.2
% OSPF: Reload or use "clear ip ospf process" command, for this to take effect
R2(config-router)#network 2.2.2.2 0.0.0.0 area 0
R2(config-router)#router ospf 1
R2(config-router)#network 10.1.1.4 0.0.0.3 area 0
R2(config-router)#network 10.1.1.0 0.0.0.3 area 12
R2(config-router)#