R4

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 9
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R4>
R4>en
Password: 
R4#ping 10.1.1.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.10, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/4/5 ms
R4#ping 10.1.1.9 
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.9, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
R4#ping 10.1.1.6
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.6, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R4#ping 10.1.4.6
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.4.6, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
R4#ping 10.1.4.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.4.10, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 1/1/1 ms
R4#ping 10.2.1.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.1.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R4#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#router eigrp 100
R4(config-router)# no auto-summary
R4(config-router)# network 10.1.4.8 0.0.0.3
R4(config-router)# network 10.1.4.4 0.0.0.3
R4(config-router)# end
R4#sh ip eigrp neigh
R4#sh ip eigrp neighbor  
EIGRP-IPv4 Neighbors for AS(100)
H   Address                 Interface              Hold Uptime   SRTT   RTO  Q  Seq
                                                   (sec)         (ms)       Cnt Num
1   10.1.4.6                Et1/0                    13 00:02:26    7   100  0  13
0   10.1.4.10               Et1/1                    12 00:02:26   12   100  0  13
R4#sh ip route eigrp   
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      10.0.0.0/8 is variably subnetted, 8 subnets, 3 masks
D        10.2.1.0/24 [90/281856] via 10.1.4.10, 00:03:29, Ethernet1/1
                     [90/281856] via 10.1.4.6, 00:03:29, Ethernet1/0
D        10.2.2.0/24 [90/281856] via 10.1.4.10, 00:03:29, Ethernet1/1
                     [90/281856] via 10.1.4.6, 00:03:29, Ethernet1/0
      192.168.1.0/27 is subnetted, 1 subnets
D        192.168.1.128 [90/281856] via 10.1.4.10, 00:03:29, Ethernet1/1
                       [90/281856] via 10.1.4.6, 00:03:29, Ethernet1/0
R4#ping 10.2.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/2/5 ms
R4#ping 10.2.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.2.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
R4#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#Int loopback 0
R4(config-if)# ip add 4.4.4.4 255.255.255.255
R4(config-if)#router ospf 1
R4(config-router)#router-id 4.4.4.4
R4(config-router)#network 4.4.4.4 0.0.0.0 area 34
R4(config-router)#network 10.1.1.8 0.0.0.3 area 34
R4(config-router)#exit
R4(config)#exit
R4#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#Int loopback 0
R4(config-if)# ip add 4.4.4.4 255.255.255.255
R4(config-if)#router ospf 1
R4(config-router)#router-id 4.4.4.4
R4(config-router)#network 4.4.4.4 0.0.0.0 area 34
R4(config-router)#network 10.1.1.8 0.0.0.3 area 34
R4(config-router)#exit
R4(config)#do sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O IA     1.1.1.1 [110/31] via 10.1.1.9, 00:00:20, Ethernet1/2
      2.0.0.0/32 is subnetted, 1 subnets
O IA     2.2.2.2 [110/21] via 10.1.1.9, 00:00:20, Ethernet1/2
      3.0.0.0/32 is subnetted, 1 subnets
O IA     3.3.3.3 [110/11] via 10.1.1.9, 00:01:10, Ethernet1/2
      10.0.0.0/8 is variably subnetted, 10 subnets, 3 masks
O IA     10.1.1.0/30 [110/30] via 10.1.1.9, 00:00:20, Ethernet1/2
O IA     10.1.1.4/30 [110/20] via 10.1.1.9, 00:00:20, Ethernet1/2
R4(config)#do sh ip protocol
*** IP Routing is NSF aware ***

Routing Protocol is "application"
  Sending updates every 0 seconds
  Invalid after 0 seconds, hold down 0, flushed after 0
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Maximum path: 32
  Routing for Networks:
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 4)

Routing Protocol is "eigrp 100"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Default networks flagged in outgoing updates
  Default networks accepted from incoming updates
  EIGRP-IPv4 Protocol for AS(100)
    Metric weight K1=1, K2=0, K3=1, K4=0, K5=0
    NSF-aware route hold timer is 240
    Router-ID: 10.1.4.9
    Topology : 0 (base) 
      Active Timer: 3 min
      Distance: internal 90 external 170
      Maximum path: 4
      Maximum hopcount 100
      Maximum metric variance 1

  Automatic Summarization: disabled
  Maximum path: 4
  Routing for Networks:
    10.1.4.4/30
    10.1.4.8/30
  Routing Information Sources:
    Gateway         Distance      Last Update
    10.1.4.10             90      01:26:13
    10.1.4.6              90      01:26:13
  Distance: internal 90 external 170

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Router ID 4.4.4.4
  Number of areas in this router is 1. 1 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    4.4.4.4 0.0.0.0 area 34
    10.1.1.8 0.0.0.3 area 34
  Routing Information Sources:
    Gateway         Distance      Last Update
    3.3.3.3              110      00:45:02
  Distance: (default is 110)

R4(config)#
R4#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O IA     1.1.1.1 [110/31] via 10.1.1.9, 00:45:20, Ethernet1/2
      2.0.0.0/32 is subnetted, 1 subnets
O IA     2.2.2.2 [110/21] via 10.1.1.9, 00:45:20, Ethernet1/2
      3.0.0.0/32 is subnetted, 1 subnets
O IA     3.3.3.3 [110/11] via 10.1.1.9, 00:46:10, Ethernet1/2
      10.0.0.0/8 is variably subnetted, 10 subnets, 3 masks
O IA     10.1.1.0/30 [110/30] via 10.1.1.9, 00:45:20, Ethernet1/2
O IA     10.1.1.4/30 [110/20] via 10.1.1.9, 00:45:20, Ethernet1/2
R4#sh arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.1.1.9              159   aabb.cc00.0a21  ARPA   Ethernet1/2
Internet  10.1.1.10               -   aabb.cc00.0921  ARPA   Ethernet1/2
Internet  10.1.4.5                -   aabb.cc00.0901  ARPA   Ethernet1/0
Internet  10.1.4.6               97   aabb.cc00.0611  ARPA   Ethernet1/0
Internet  10.1.4.9                -   aabb.cc00.0911  ARPA   Ethernet1/1
Internet  10.1.4.10              97   aabb.cc00.0711  ARPA   Ethernet1/1
R4#config t 
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#hostname R4-Cisco
R4-Cisco(config)#end
R4-Cisco#sh int e1/0
Ethernet1/0 is up, line protocol is up 
  Hardware is AmdP2, address is aabb.cc00.0901 (bia aabb.cc00.0901)
  Internet address is 10.1.4.5/30
  MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:04, output 00:00:00, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     1711 packets input, 183938 bytes, 0 no buffer
     Received 1689 broadcasts (1491 IP multicasts)
     0 runts, 0 giants, 0 throttles 
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 input packets with dribble condition detected
     2900 packets output, 251085 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     5 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out
R4-Cisco#config T
Enter configuration commands, one per line.  End with CNTL/Z.
R4-Cisco(config)#router eigrp 100
R4-Cisco(config-router)#redistribute ospf 1 metric 10000 100 255 1 1500
R4-Cisco(config-router)# exit
R4-Cisco(config)#router ospf 1
R4-Cisco(config-router)#redistribute eigrp 100 subnets
R4-Cisco(config-router)#end
R4-Cisco#ping 8.8.8.8
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 8.8.8.8, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R4-Cisco#

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 9
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R4>en
Password: 
R4#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#Int loopback 0
R4(config-if)# ip add 4.4.4.4 255.255.255.255
R4(config-if)#router ospf 1
R4(config-router)#router-id 4.4.4.4
R4(config-router)#network 4.4.4.4 0.0.0.0 area 34
R4(config-router)#network 10.1.1.8 0.0.0.3 area 34
R4(config-router)#
R4#config T
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#router eigrp 100
R4(config-router)#redistribute ospf 1 metric 10000 100 255 1 1500
R4(config-router)# exit
R4(config)#router ospf 1
R4(config-router)#redistribute eigrp 100 subnets
R4(config-router)#end
R4#

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 9
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R4>
R4>en
Password: 
R4#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#Int loopback 0
R4(config-if)# ip add 4.4.4.4 255.255.255.255
R4(config-if)#router ospf 1
R4(config-router)#router-id 4.4.4.4
R4(config-router)#network 4.4.4.4 0.0.0.0 area 34
R4(config-router)#network 10.1.1.8 0.0.0.3 area 34
R4(config-router)#exit
R4(config)#config T
                  ^
% Invalid input detected at '^' marker.

R4(config)#router eigrp 100
R4(config-router)#redistribute ospf 1 metric 10000 100 255 1 1500
R4(config-router)# exit
R4(config)#router ospf 1
R4(config-router)#redistribute eigrp 100 subnets
R4(config-router)#end
R4#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#router eigrp 100
R4(config-router)# no auto-summary
R4(config-router)# network 10.1.4.8 0.0.0.3
R4(config-router)# network 10.1.4.4 0.0.0.3
R4(config-router)# end
R4#ping 8.8.8.8
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 8.8.8.8, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
R4#show ip eigrp neighbor
EIGRP-IPv4 Neighbors for AS(100)
H   Address                 Interface              Hold Uptime   SRTT   RTO  Q  Seq
                                                   (sec)         (ms)       Cnt Num
1   10.1.4.6                Et1/0                    12 00:02:35   12   100  0  17
0   10.1.4.10               Et1/1                    14 00:02:35 1601  5000  0  18
R4#
R4#