R3
   Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 10
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R3>
R3>en
Password: 
R3#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#Int loopback 0
R3(config-if)# ip add 3.3.3.3 255.255.255.255
R3(config-if)#router ospf 1
R3(config-router)#router-id 3.3.3.3
% OSPF: Reload or use "clear ip ospf process" command, for this to take effect
R3(config-router)#network 3.3.3.3 0.0.0.0 area 0
R3(config-router)#router ospf 1
R3(config-router)#network 10.1.1.4 0.0.0.3 area 0
R3(config-router)#network 10.1.1.8 0.0.0.3 area 0
R3(config-router)#exit
R3(config)#do show ip protocols
*** IP Routing is NSF aware ***

Routing Protocol is "application"
  Sending updates every 0 seconds
  Invalid after 0 seconds, hold down 0, flushed after 0
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Maximum path: 32
  Routing for Networks:
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 4)

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Router ID 10.1.1.9
  Number of areas in this router is 1. 1 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    3.3.3.3 0.0.0.0 area 0
    10.1.1.4 0.0.0.3 area 0
    10.1.1.8 0.0.0.3 area 0
  Routing Information Sources:
    Gateway         Distance      Last Update
    10.1.1.5             110      00:02:33
  Distance: (default is 110)

R3(config)#exit
R3#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#no router ospf 1
R3(config)#Int loopback 0
R3(config-if)# ip add 3.3.3.3 255.255.255.255
R3(config-if)#router ospf 1
R3(config-router)#router-id 3.3.3.3
R3(config-router)#network 3.3.3.3 0.0.0.0 area 0
R3(config-router)#router ospf 1
R3(config-router)#network 10.1.1.4 0.0.0.3 area 0
R3(config-router)#network 10.1.1.8 0.0.0.3 area 34
R3(config-router)#
R3#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#hostname R3-Microtik
R3-Microtik(config)#
R3-Microtik#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O IA     1.1.1.1 [110/21] via 10.1.1.5, 01:33:30, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.1.1.5, 01:33:30, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/11] via 10.1.1.10, 01:34:16, Ethernet1/2
      10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
O IA     10.1.1.0/30 [110/20] via 10.1.1.5, 01:33:30, Ethernet1/1
O E2     10.1.4.4/30 [110/20] via 10.1.1.10, 00:09:23, Ethernet1/2
O E2     10.1.4.8/30 [110/20] via 10.1.1.10, 00:09:23, Ethernet1/2
O E2     10.2.1.0/24 [110/20] via 10.1.1.10, 00:09:23, Ethernet1/2
O E2     10.2.2.0/24 [110/20] via 10.1.1.10, 00:09:23, Ethernet1/2
      192.168.1.0/27 is subnetted, 1 subnets
O E2     192.168.1.128 [110/20] via 10.1.1.10, 00:09:23, Ethernet1/2
R3-Microtik#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.1.1.5, 01:34:13, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/11] via 10.1.1.10, 01:34:59, Ethernet1/2
      10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
O IA     10.1.1.0/30 [110/20] via 10.1.1.5, 01:34:13, Ethernet1/1
O E2     10.1.4.4/30 [110/20] via 10.1.1.10, 00:10:06, Ethernet1/2
O E2     10.1.4.8/30 [110/20] via 10.1.1.10, 00:10:06, Ethernet1/2
O E2     10.2.1.0/24 [110/20] via 10.1.1.10, 00:10:06, Ethernet1/2
O E2     10.2.2.0/24 [110/20] via 10.1.1.10, 00:10:06, Ethernet1/2
      192.168.1.0/27 is subnetted, 1 subnets
O E2     192.168.1.128 [110/20] via 10.1.1.10, 00:10:06, Ethernet1/2
R3-Microtik#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O IA     1.1.1.1 [110/21] via 10.1.1.5, 00:00:02, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.1.1.5, 01:35:02, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/11] via 10.1.1.10, 01:35:48, Ethernet1/2
      10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
O IA     10.1.1.0/30 [110/20] via 10.1.1.5, 01:35:02, Ethernet1/1
O E2     10.1.4.4/30 [110/20] via 10.1.1.10, 00:10:55, Ethernet1/2
O E2     10.1.4.8/30 [110/20] via 10.1.1.10, 00:10:55, Ethernet1/2
O E2     10.2.1.0/24 [110/20] via 10.1.1.10, 00:10:55, Ethernet1/2
O E2     10.2.2.0/24 [110/20] via 10.1.1.10, 00:10:55, Ethernet1/2
      192.168.1.0/27 is subnetted, 1 subnets
O E2     192.168.1.128 [110/20] via 10.1.1.10, 00:10:55, Ethernet1/2
R3-Microtik#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
O IA     1.1.1.1 [110/21] via 10.1.1.5, 00:43:37, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.1.1.5, 02:18:37, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/11] via 10.1.1.10, 02:19:23, Ethernet1/2
      10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
O IA     10.1.1.0/30 [110/20] via 10.1.1.5, 02:18:37, Ethernet1/1
O E2     10.1.4.4/30 [110/20] via 10.1.1.10, 00:54:30, Ethernet1/2
O E2     10.1.4.8/30 [110/20] via 10.1.1.10, 00:54:30, Ethernet1/2
O E2     10.2.1.0/24 [110/20] via 10.1.1.10, 00:54:30, Ethernet1/2
O E2     10.2.2.0/24 [110/20] via 10.1.1.10, 00:54:30, Ethernet1/2
      192.168.1.0/27 is subnetted, 1 subnets
O E2     192.168.1.128 [110/20] via 10.1.1.10, 00:54:30, Ethernet1/2
R3-Microtik#sh ip route ospf
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is 10.1.1.5 to network 0.0.0.0

O*E2  0.0.0.0/0 [110/1] via 10.1.1.5, 00:00:17, Ethernet1/1
      1.0.0.0/32 is subnetted, 1 subnets
O IA     1.1.1.1 [110/21] via 10.1.1.5, 00:43:58, Ethernet1/1
      2.0.0.0/32 is subnetted, 1 subnets
O        2.2.2.2 [110/11] via 10.1.1.5, 02:18:58, Ethernet1/1
      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/11] via 10.1.1.10, 02:19:44, Ethernet1/2
      10.0.0.0/8 is variably subnetted, 9 subnets, 3 masks
O IA     10.1.1.0/30 [110/20] via 10.1.1.5, 02:18:58, Ethernet1/1
O E2     10.1.4.4/30 [110/20] via 10.1.1.10, 00:54:51, Ethernet1/2
O E2     10.1.4.8/30 [110/20] via 10.1.1.10, 00:54:51, Ethernet1/2
O E2     10.2.1.0/24 [110/20] via 10.1.1.10, 00:54:51, Ethernet1/2
O E2     10.2.2.0/24 [110/20] via 10.1.1.10, 00:54:51, Ethernet1/2
      192.168.1.0/27 is subnetted, 1 subnets
O E2     192.168.1.128 [110/20] via 10.1.1.10, 00:54:51, Ethernet1/2
R3-Microtik#ping 8.8.8.8
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 8.8.8.8, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
R3-Microtik#

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 10
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R3>
R3>en
Password: 
Password: 
R3#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#Int loopback 0
R3(config-if)# ip add 3.3.3.3 255.255.255.255
R3(config-if)#router ospf 1
R3(config-router)#router-id 3.3.3.3
% OSPF: Reload or use "clear ip ospf process" command, for this to take effect
R3(config-router)#network 3.3.3.3 0.0.0.0 area 0
R3(config-router)#router ospf 1
R3(config-router)#network 10.1.1.4 0.0.0.3 area 0
R3(config-router)#network 10.1.1.8 0.0.0.3 area 34
R3(config-router)#

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, Linux Software (I86BI_LINUX-ADVENTERPRISEK9-M), Version 15.3(1.3)T, ENGINEERING WEEKLY BUILD, synced to V152_4_M1_10
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 25-Oct-12 04:35 by hlo


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Linux Unix (Intel-x86) processor with 113130K bytes of memory.
Processor board ID 10
16 Ethernet interfaces
128K bytes of NVRAM.



Press RETURN to get started!


R3>en
Password: 
R3#Int loopback 0
    ^
% Invalid input detected at '^' marker.

R3# ip add 3.3.3.3 255.255.255.255
       ^
% Invalid input detected at '^' marker.

R3#router ospf 1
       ^
% Invalid input detected at '^' marker.

R3#router-id 3.3.3.3
       ^
% Invalid input detected at '^' marker.

R3#network 3.3.3.3 0.0.0.0 area 0
    ^
% Invalid input detected at '^' marker.

R3#router ospf 1
       ^
% Invalid input detected at '^' marker.

R3#network 10.1.1.4 0.0.0.3 area 0
    ^
% Invalid input detected at '^' marker.

R3#network 10.1.1.8 0.0.0.3 area 34
    ^
% Invalid input detected at '^' marker.

R3#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#Int loopback 0
R3(config-if)# ip add 3.3.3.3 255.255.255.255
R3(config-if)#router ospf 1
R3(config-router)#router-id 3.3.3.3
% OSPF: Reload or use "clear ip ospf process" command, for this to take effect
R3(config-router)#network 3.3.3.3 0.0.0.0 area 0
R3(config-router)#router ospf 1
R3(config-router)#network 10.1.1.4 0.0.0.3 area 0
R3(config-router)#network 10.1.1.8 0.0.0.3 area 34
R3(config-router)#